; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph1 - mode
	thermograph8 - mode
	infrared0 - mode
	spectrograph5 - mode
	spectrograph7 - mode
	thermograph6 - mode
	thermograph4 - mode
	thermograph2 - mode
	infrared3 - mode
	GroundStation5 - direction
	Star6 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation2 - direction
	Star0 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph6)
	(supports instrument0 spectrograph7)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph7)
	(supports instrument1 spectrograph5)
	(supports instrument1 thermograph8)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 thermograph4)
	(supports instrument2 spectrograph7)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph6)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
)
(:goal (and
	(pointing satellite1 Star4)
	(pointing satellite2 Star0)
	(have_image Star7 thermograph2)
	(have_image Star7 thermograph6)
	(have_image Phenomenon8 thermograph8)
	(have_image Phenomenon8 infrared0)
	(have_image Planet9 spectrograph7)
	(have_image Planet9 infrared0)
	(have_image Planet9 spectrograph5)
	(have_image Star10 spectrograph5)
	(have_image Star10 thermograph8)
	(have_image Planet11 infrared3)
	(have_image Planet11 thermograph2)
	(have_image Planet11 thermograph6)
))

)

; plan
1. (turn_to satellite2 groundstation2 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 14
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 14
3. (calibrate satellite2 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 14
4. (turn_to satellite2 planet9 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet9)
   goals met: 0 of 14
5. (take_image satellite2 planet9 instrument3 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 1 of 14
6. (turn_to satellite2 phenomenon8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 14
7. (turn_to satellite1 star4 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star4)
   goals met: 2 of 14
8. (turn_to satellite0 groundstation1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 14
9. (take_image satellite2 phenomenon8 instrument3 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 3 of 14
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 14
11. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 3 of 14
12. (turn_to satellite0 planet11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet11)
   goals met: 3 of 14
13. (take_image satellite0 planet11 instrument0 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 4 of 14
14. (take_image satellite0 planet11 instrument0 thermograph6)
   added: (have_image planet11 thermograph6)
   goals met: 5 of 14
15. (turn_to satellite0 star7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star7)
   goals met: 5 of 14
16. (take_image satellite0 star7 instrument0 thermograph6)
   added: (have_image star7 thermograph6)
   goals met: 6 of 14
17. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 14
18. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 6 of 14
19. (turn_to satellite0 groundstation3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation3)
   goals met: 6 of 14
20. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 6 of 14
21. (turn_to satellite0 phenomenon8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 14
22. (take_image satellite0 phenomenon8 instrument1 thermograph8)
   added: (have_image phenomenon8 thermograph8)
   goals met: 7 of 14
23. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 7 of 14
24. (take_image satellite0 planet11 instrument1 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 8 of 14
25. (turn_to satellite0 planet9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet9)
   goals met: 8 of 14
26. (take_image satellite0 planet9 instrument1 spectrograph5)
   added: (have_image planet9 spectrograph5)
   goals met: 9 of 14
27. (take_image satellite0 planet9 instrument1 spectrograph7)
   added: (have_image planet9 spectrograph7)
   goals met: 10 of 14
28. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 10 of 14
29. (take_image satellite0 star10 instrument1 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 11 of 14
30. (take_image satellite0 star10 instrument1 thermograph8)
   added: (have_image star10 thermograph8)
   goals met: 12 of 14
31. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 12 of 14
32. (take_image satellite0 star7 instrument1 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 13 of 14
33. (turn_to satellite2 star0 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star0)
   goals met: 14 of 14
